# -*- coding:utf-8 -*-
INTERNAL_ACCOUNT_DICT_FORMAT={
				"TO_RMB":"*2","RATE":"*7","GIVE_AMT":"*2","BALANCE":"*2","GIVE_DATE":"YYYYMMDD",
				"COLLECTED_INTEREST":"*2","OPEN_DATE":"YYYYMMDD","CLOSE_DATE":"YYYYMMDD","DUE_DATE":"YYYYMMDD",
				"LOAN_EXECUTE":"*7","CONTRACT_RATE":"*7","EXECUTE_RATE":"*7","TO_USD":"*2","INCOME":"*2",
				"PAYED_INTEREST":"*2","PAYABLE_INTEREST":"*2","DATE_ID":"YYYYMMDD","VALIDATE_DATE":"YYYYMMDD",
				"OPEN_CARD_DATE":"YYYYMMDD","MAKE_CARD_DATE":"YYYYMMDD","GIVE_CARD_DATE":"YYYYMMDD","CLOSE_CARD_DATE":"YYYYMMDD",
				"LAST_CALC_INTEREST_DATE":"YYYYMMDD","LOYAT":"*2","LAST_TRAN_DATE":"YYYYMMDD","LAST_SETTLE_DATE":"YYYYMMDD",
				"PLEDGE_INVALI_DATE":"YYYYMMDD","GIVE_AMOUNT":"*2","CONTRACT_AMOUNT":"*2","IN_INTEREST":"*2",
				"OUT_INTEREST":"*2","PDT":"*2","ADJ_INTEREST":"*2","ADJ_PDT":"*2",
				"EXTEND_PRICE_AMOUNT":"*2","PLEDGE_VALUE":"*2","DRAFT_AMOUNT":"*2","DRAFT_DATE":"YYYYMMDD","DISCOUNT_DATE":"YYYYMMDD",
				"DISCOUNT_RATE":"*7","DISCOUN_INTEREST":"*2","REGISTER_DATE":"YYYYMMDD","RECOVER_AMOUNT":"*2","DISCOUNT_TERM":"*2",
}
DEPOSIT_ACCOUNT_DICT_FORMAT={
				"TO_RMB":"*2","RATE":"*7","GIVE_AMT":"*2","BALANCE":"*2","GIVE_DATE":"YYYYMMDD",
				"COLLECTED_INTEREST":"*2","OPEN_DATE":"YYYYMMDD","CLOSE_DATE":"YYYYMMDD","DUE_DATE":"YYYYMMDD",
				"LOAN_EXECUTE":"*7","CONTRACT_RATE":"*7","EXECUTE_RATE":"*7","TO_USD":"*2","INCOME":"*2",
				"PAYED_INTEREST":"*2","PAYABLE_INTEREST":"*2","DATE_ID":"YYYYMMDD","VALIDATE_DATE":"YYYYMMDD",
				"OPEN_CARD_DATE":"YYYYMMDD","MAKE_CARD_DATE":"YYYYMMDD","GIVE_CARD_DATE":"YYYYMMDD","CLOSE_CARD_DATE":"YYYYMMDD",
				"LAST_CALC_INTEREST_DATE":"YYYYMMDD","LOYAT":"*2","LAST_TRAN_DATE":"YYYYMMDD","LAST_SETTLE_DATE":"YYYYMMDD",
				"PLEDGE_INVALI_DATE":"YYYYMMDD","GIVE_AMOUNT":"*2","CONTRACT_AMOUNT":"*2","IN_INTEREST":"*2","DISCOUNT_TERM":"*2",
				"OUT_INTEREST":"*2","PDT":"*2","ADJ_INTEREST":"*2","ADJ_PDT":"*2","BIRTH_DAY":"YYYYMMDD",
				"EXTEND_PRICE_AMOUNT":"*2","PLEDGE_VALUE":"*2","DRAFT_AMOUNT":"*2","DRAFT_DATE":"YYYYMMDD","DISCOUNT_DATE":"YYYYMMDD",
				"DISCOUNT_RATE":"*7","DISCOUN_INTEREST":"*2","REGISTER_DATE":"YYYYMMDD","RECOVER_AMOUNT":"*2","BIRTH_DAY":"YYYYMMDD"
}
LOAN_ACCOUNT_DICT_FORMAT={
				"TO_RMB":"*2","RATE":"*7","GIVE_AMT":"*2" ,"GIVE_DATE":"YYYYMMDD",
				"COLLECTED_INTEREST":"*2","OPEN_DATE":"YYYYMMDD","CLOSE_DATE":"YYYYMMDD","DUE_DATE":"YYYYMMDD",
				"LOAN_EXECUTE":"*7","CONTRACT_RATE":"*7","EXECUTE_RATE":"*7","TO_USD":"*2","INCOME":"*2",
				"PAYED_INTEREST":"*2","PAYABLE_INTEREST":"*2","DATE_ID":"YYYYMMDD","VALIDATE_DATE":"YYYYMMDD",
				"OPEN_CARD_DATE":"YYYYMMDD","MAKE_CARD_DATE":"YYYYMMDD","GIVE_CARD_DATE":"YYYYMMDD","CLOSE_CARD_DATE":"YYYYMMDD",
				"LAST_CALC_INTEREST_DATE":"YYYYMMDD","LOYAT":"*2","LAST_TRAN_DATE":"YYYYMMDD","LAST_SETTLE_DATE":"YYYYMMDD",
				"PLEDGE_INVALI_DATE":"YYYYMMDD","GIVE_AMOUNT":"*2","CONTRACT_AMOUNT":"*2",
				"EXTEND_PRICE_AMOUNT":"*2","PLEDGE_VALUE":"*2","DRAFT_AMOUNT":"*2","DRAFT_DATE":"YYYYMMDD","DISCOUNT_DATE":"YYYYMMDD",
				"DISCOUNT_RATE":"*7","DISCOUN_INTEREST":"*2","REGISTER_DATE":"YYYYMMDD","RECOVER_AMOUNT":"*2","DISCOUNT_TERM":"*2"
				,"BALANCE":"*2"
				,"WRITE_OFF_AMOUNT":"*2"
				,"WRITE_OFF_INT":"*2"
				,"IN_INTEREST":"*2"
				,"OUT_INTEREST":"*2"
				,"RE_OUT_INTEREST":"*2"
				,"INTEREST_INCOME":"*2",
				"OVERDUE_ANOUNT":"*2"
				,"PENALTY_INCOME":"*2"
				,"SUM_INTEREST_INCOME":"*2"
				,"SUM_PENALTY_INCOME":"*2"
				,"SUM_CANCEL_AMOUNT":"*2"
				,"DEBIT_INTEREST":"*2"
				,"OUGHT_REFUND_DATE":"YYYYMMDD"
				,"TRUE_REFUND_DATE":"YYYYMMDD"
} 
OUTSHEET_ACCOUNT_DICT_FORMAT={
				"TO_RMB":"*2","RATE":"*7","GIVE_AMT":"*2","BALANCE":"*2","GIVE_DATE":"YYYYMMDD",
				"COLLECTED_INTEREST":"*2","OPEN_DATE":"YYYYMMDD","CLOSE_DATE":"YYYYMMDD","DUE_DATE":"YYYYMMDD",
				"LOAN_EXECUTE":"*7","CONTRACT_RATE":"*7","EXECUTE_RATE":"*7","TO_USD":"*2","INCOME":"*2",
				"PAYED_INTEREST":"*2","PAYABLE_INTEREST":"*2","DATE_ID":"YYYYMMDD","VALIDATE_DATE":"YYYYMMDD",
				"OPEN_CARD_DATE":"YYYYMMDD","MAKE_CARD_DATE":"YYYYMMDD","GIVE_CARD_DATE":"YYYYMMDD","CLOSE_CARD_DATE":"YYYYMMDD",
				"LAST_CALC_INTEREST_DATE":"YYYYMMDD","LOYAT":"*2","LAST_TRAN_DATE":"YYYYMMDD","LAST_SETTLE_DATE":"YYYYMMDD",
				"PLEDGE_INVALI_DATE":"YYYYMMDD","GIVE_AMOUNT":"*2","CONTRACT_AMOUNT":"*2","IN_INTEREST":"*2",
				"OUT_INTEREST":"*2","PDT":"*2","ADJ_INTEREST":"*2","ADJ_PDT":"*2",
				"EXTEND_PRICE_AMOUNT":"*2","PLEDGE_VALUE":"*2","DRAFT_AMOUNT":"*2","DRAFT_DATE":"YYYYMMDD","DISCOUNT_DATE":"YYYYMMDD",
				"DISCOUNT_RATE":"*7","DISCOUN_INTEREST":"*2","REGISTER_DATE":"YYYYMMDD","RECOVER_AMOUNT":"*2","DISCOUNT_TERM":"*2"
} 
LEDGE_ACCOUNT_DICT_FORMAT={
				"TO_RMB":"*2","RATE":"*7","GIVE_AMT":"*2","BALANCE":"*2","GIVE_DATE":"YYYYMMDD",
				"COLLECTED_INTEREST":"*2","OPEN_DATE":"YYYYMMDD","CLOSE_DATE":"YYYYMMDD","DUE_DATE":"YYYYMMDD",
				"LOAN_EXECUTE":"*7","CONTRACT_RATE":"*7","EXECUTE_RATE":"*7","TO_USD":"*2","INCOME":"*2",
				"PAYED_INTEREST":"*2","PAYABLE_INTEREST":"*2","DATE_ID":"YYYYMMDD","VALIDATE_DATE":"YYYYMMDD",
				"OPEN_CARD_DATE":"YYYYMMDD","MAKE_CARD_DATE":"YYYYMMDD","GIVE_CARD_DATE":"YYYYMMDD","CLOSE_CARD_DATE":"YYYYMMDD",
				"LAST_CALC_INTEREST_DATE":"YYYYMMDD","LOYAT":"*2","LAST_TRAN_DATE":"YYYYMMDD","LAST_SETTLE_DATE":"YYYYMMDD",
				"PLEDGE_INVALI_DATE":"YYYYMMDD","GIVE_AMOUNT":"*2","CONTRACT_AMOUNT":"*2","IN_INTEREST":"*2",
				"OUT_INTEREST":"*2","PDT":"*2","ADJ_INTEREST":"*2","ADJ_PDT":"*2",
				"EXTEND_PRICE_AMOUNT":"*2","PLEDGE_VALUE":"*2","DRAFT_AMOUNT":"*2","DRAFT_DATE":"YYYYMMDD","DISCOUNT_DATE":"YYYYMMDD",
				"DISCOUNT_RATE":"*7","DISCOUN_INTEREST":"*2","REGISTER_DATE":"YYYYMMDD","RECOVER_AMOUNT":"*2","DISCOUNT_TERM":"*2",
				"LAST_DEBIT_BALANCE":"*2","LAST_CREDIT_BALANCE":"*2","DEBIT_AMOUNT":"*2",
				"CREDIT_AMOUNT":"*2","DEBIT_BALANCE":"*2","CREDIT_BALANCE":"*2",
				"OPEN_ACCOUNT_NUM":"*2","CLOSE_ACCOUNT_NUM":"*2","LAST_ACCOUNT_NUMS":"*2","ACCOUNT_NUM":"*2",
				"DEBIT_CNT":"*2","CREDIT_CNT":"*2"
} 
TRANSACTION_ACCOUNT_DICT_FORMAT={
				"TO_RMB":"*2","RATE":"*7","GIVE_AMT":"*2","BALANCE":"*2","GIVE_DATE":"YYYYMMDD",
				"COLLECTED_INTEREST":"*2","OPEN_DATE":"YYYYMMDD","CLOSE_DATE":"YYYYMMDD","DUE_DATE":"YYYYMMDD",
				"LOAN_EXECUTE":"*7","CONTRACT_RATE":"*7","EXECUTE_RATE":"*7","TO_USD":"*2","INCOME":"*2",
				"PAYED_INTEREST":"*2","PAYABLE_INTEREST":"*2","DATE_ID":"YYYYMMDD","VALIDATE_DATE":"YYYYMMDD",
				"OPEN_CARD_DATE":"YYYYMMDD","MAKE_CARD_DATE":"YYYYMMDD","GIVE_CARD_DATE":"YYYYMMDD","CLOSE_CARD_DATE":"YYYYMMDD",
				"LAST_CALC_INTEREST_DATE":"YYYYMMDD","LOYAT":"*2","LAST_TRAN_DATE":"YYYYMMDD","LAST_SETTLE_DATE":"YYYYMMDD",
				"PLEDGE_INVALI_DATE":"YYYYMMDD","GIVE_AMOUNT":"*2","CONTRACT_AMOUNT":"*2","IN_INTEREST":"*2",
				"OUT_INTEREST":"*2","PDT":"*2","ADJ_INTEREST":"*2","ADJ_PDT":"*2",
				"EXTEND_PRICE_AMOUNT":"*2","PLEDGE_VALUE":"*2","DRAFT_AMOUNT":"*2","DRAFT_DATE":"YYYYMMDD","DISCOUNT_DATE":"YYYYMMDD",
				"DISCOUNT_RATE":"*7","DISCOUN_INTEREST":"*2","REGISTER_DATE":"YYYYMMDD","RECOVER_AMOUNT":"*2","DISCOUNT_TERM":"*2",
				"LAST_DEBIT_BALANCE":"*2","LAST_CREDIT_BALANCE":"*2","DEBIT_AMOUNT":"*2",
				"CREDIT_AMOUNT":"*2","DEBIT_BALANCE":"*2","CREDIT_BALANCE":"*2",
				"OPEN_ACCOUNT_NUM":"*2","CLOSE_ACCOUNT_NUM":"*2","LAST_ACCOUNT_NUMS":"*2","ACCOUNT_NUM":"*2",
				"DEBIT_CNT":"*2","CREDIT_CNT":"*2","COLLECTION_DATE":"YYYYMMDD","AMOUNT":"*2","PENAL_AMOUNT":"*2",
				"INTEREST":"*2","PENAL_INTEREST":"*2","RE_INTEREST":"*2","RE_PENAL_INTEREST":"*2",
				"AMOUNT":"*2","BALANCE":"*2"
				,"TRAN_DATE":"YYYYMMDD"
				,"TRAN_DATE2":"YYYYMMDD","DURATION_TIME":"int"
				,"AMOUNT":"*2","FEE":"*2","FEE2":"*2","SETTLEMENT_AMOUNT":"*2","TRANSMISSION_TIME":"int","CIFSEQ":"int"
				
} 


LOAN_ACCOUNT_CODEDICT={ 
					"PE_FLAG":{'1':u'个人','2':u'单位','3':u'金融',},
					"APPLY_TYPE":{'11':u'对私农户','12':u'对私学生','13':u'对私个体工商户','14':u'对私其他个人',
					'21':u'对公农业经济组织','22':u'对公农村工业','23':u'对公农村商业','24':u'对公其他经济组织'},
					"ACCOUNT_STATUS":{'a':u'正常','b':u'逾期','h':u'核销','d':u'销户','f':u'呆滞','g':u'呆账','o':u'结清'},
					"CONTRACTY_TYPE":{'11':u'借款合同','12':u'融资合同','13':u'担保合同','14':u'信贷资产转让合同','15':u'资金业务合同',
					'17':u'信用站借款合同','90':u'展期合同','99':u'其他合同'},
					"GUA_TYPE":{'100':u'信用','210':u'普通保证','220':u'联保','300':u'抵押','411':u'系统内存单质押','412':u'系统外存单质押',
					'421':u'系统内股金质押','422':u'系统外股金质押','490':u'其他质押','532':u'抵押＋保证','542':u'质押＋保证','1':u'信用','2':u'保证','3':u'抵押','4':u'质押'},
					"ACCOUNT_CLASSIFY":{'L':u'贷款账户','D':u'存款账户','I':u'内部账户'},
					"LOAN_ACCOUNT_STATUS":{'a':u'正常','b':u'逾期','h':u'核销','d':u'销户','f':u'呆滞','g':u'呆账','o':u'结清'},
					"FUND_SRC":{'1':u'自营','2':u'委托','3':u'特种'}
}
LOAN_ACCOUNT_CODEDICT={}
TRANSACTION_ACCOUNT_CODEDICT={}
# DEPOSIT_ACCOUNT_CODEDICT={ 
					# "PE_FLAG":{'1':u'个人','2':u'单位','3':u'金融',},
					# "ACCOUNT_STATUS":{'0':u'销户','1':u'正常','2':u'新开户(未启用)','3':u'结清','4':u'审批','5':u'作废','7':u'抹帐','7':u'冲正',
					# '8':u'开卡未制','9':u'发卡未启用','10':u'换卡未启用','11':u'换卡已启用','12':u'转营业外收入','13':u'已收卡'},
					# "ACCOUNT_CLASSIFY":{'L':u'贷款账户','D':u'存款账户','I':u'内部账户'},
					# "FUND_SRC":{'1':u'自营','2':u'委托','3':u'特种'},
					# "AUTO_TRAN":{'0':u'不自动转存','1':u'自动转存'},
					# "ACCTOUN_TYPE":{'0021':u'基本户','0022':u'一般户','0023':u'专用户','0024':u'临时户','0025':u'验资户','0011':u'个人结算',
					# '0012':u'活期储蓄','8001':u'资格股帐户','8002':u'投资股帐户','8003':u'其他股帐户'}
# } 
LEDGE_ACCOUNT_CODEDICT={}
busi_type = {'101':u'重要空白凭证','1011':u'现金','1012':u'业务周转金','1013':u'在途外币资金','102':u'有价单证','103':u'未发行有价证券','104':u'已兑付有价单证','105':u'代保管有价值品',
					'108':u'已核销呆帐','1081':u'冲销表内应收利息','1531':u'固定资产清理','1541':u'在建工程','1711':u'无形资产','1721':u'递延资产','1723':u'广告费结转','2151':u'定期储蓄存款',
					'21511':u'整存整取一年以下储蓄存款','2155':u'教育储蓄存款','2311':u'借入银行款','2312':u'借入中央银行款项','2313':u'借入支农再贷款','2314':u'代理业务负债','2317':u'拨入营运资金','1731':u'待处理财产损溢',
					'2011':u'活期存款','2012':u'财政性存款','2013':u'待结算财政款项','20131':u'县级待结算财政款项','2014':u'地方财政库款','20141':u'县级地方财政库款','2321':u'同业存放款项','2323':u'信用社上存联社款项',
					'23231':u'县联社扶持款项','2412':u'调入调剂资金','2413':u'银行业拆入','2415':u'卖出回购债券款','2051':u'定期存款','20511':u'整存整取一年以下定期存款','2015':u'财政预算外存款','20151':u'县级财政预算外存款',
					'2017':u'央行拨付专项票据资金','2017':u'银行卡','1512':u'不计提折旧固定资产','1521':u'累计折旧','2731':u'长期应付款','2735':u'递延税款','0797':u'转贴现/再贴现利息收入','0701':u'担保业务手续费收入',
					'0707':u'资格股','0703':u'待解临时款项','0792':u'待清算款项','0797':u'社（行）内往来财管专户','0800':u'农户贷款利息收入','0801':u'农业经济组织贷款利息收入','0802':u'农村工商业贷款利息收入','0803':u'其他贷款利息收入',
					'1242':u'中长期农业经济组织贷款','1243':u'中长期农村工商业贷款','1244':u'中长期其他贷款','1247':u'农户小额信用贷款','1247':u'农户联保贷款','1248':u'助学贷款','12481':u'国家助学贷款','1251':u'抵押农户贷款',
					'1252':u'抵押农业经济组织贷款','1253':u'抵押农村工商业贷款','1254':u'抵押其他贷款','1255':u'质押农户贷款','1257':u'质押农业经济组织贷款','1257':u'质押农村工商业贷款','1237':u'信用卡透支','1241':u'中长期农户贷款',
					'12711':u'逾期农户住房消费贷款','12712':u'逾期农户汽车消费贷款','1272':u'逾期农业经济组织贷款','1273':u'逾期农村工商业贷款','1274':u'逾期其他贷款','1277':u'逾期农户小额信用贷款','1277':u'逾期农户联保贷款','1278':u'逾期助学贷款',
					'12781':u'逾期国家助学贷款','1279':u'银行承兑汇票垫款','1271':u'呆滞农户贷款','12711':u'呆滞农户住房消费贷款','12712':u'呆滞农户汽车消费贷款','1272':u'呆滞农业经济组织贷款','1273':u'呆滞农村工商业贷款','1293':u'买入外币票据',
					'1295':u'买入返售债券','1297':u'买入返售信贷资产','1301':u'农户贷款','1304':u'非农贷款','0542':u'银行汇票保证金','0543':u'融资性担保机构客户担保保证金','0544':u'承兑汇票保证金','0545':u'承兑汇票保证金',
					'0510':u'信用社上存联社款项','0523':u'调入调剂资金','0587':u'长期应付款','0587':u'递延税款','0590':u'外汇买卖','0594':u'外币兑换','0599':u'住房周转金','0701':u'待解现代支付',
					'0702':u'待解电子联行','0577':u'其它统筹金收入','0577':u'其他统筹金支出','0527':u'拨入营运资金','0707':u'住房公积金','0707':u'职工10%风险金','0708':u'应付暂收手续费','0709':u'应付劳动分红',
					'0710':u'工本费','0711':u'邮电费','0712':u'其他应付款项','0751':u'待清算款项往账','0578':u'应交税金','0777':u'省辖汇兑汇差','0777':u'县辖往帐','0778':u'县辖来帐',
					'0779':u'上年县辖往帐','0780':u'上年县辖来帐','0783':u'县辖往来','0784':u'省辖通存通兑汇差','0791':u'社内往来','0752':u'上年待清算往账','0755':u'上年待清算来账','0757':u'待清算款项来账',
					'0773':u'垫款利息收入','0774':u'信用卡透支利息收入','0971':u'代收外汇托收款项','0972':u'已核销呆账贷款（移植）','0944':u'历年贷款应收利息','1321':u'代理业务资产','1323':u'应收再贴现款项','1274':u'呆滞其他贷款',
					'1258':u'质押其他贷款','1271':u'逾期农户贷款','1278':u'呆滞助学贷款','12781':u'呆滞国家助学贷款','1281':u'呆帐农户贷款','12811':u'呆帐农户住房消费贷款','12812':u'呆帐农户汽车消费贷款','1324':u'应收转贴现款项',
					'1391':u'其他应收款','1392':u'委托及代理资产业务','1411':u'短期投资','14111':u'短期银行间市场债券投资','1421':u'长期投资','14211':u'长期银行间市场债券投资','1422':u'入股联社资金','1282':u'呆帐农业经济组织贷款',
					'1283':u'呆帐农村工商业贷款','1284':u'呆帐其他贷款','1287':u'呆帐农户小额信用贷款','1287':u'呆帐农户联保贷款','1288':u'呆帐助学贷款','12881':u'呆帐国家助学贷款','1289':u'贴现','12891':u'转贴现款项',
					'12892':u'再贴现款项','1290':u'待处理抵债资产','1277':u'呆滞农户小额信用贷款','1277':u'呆滞农户联保贷款','2111':u'活期储蓄存款','21111':u'个人结算户存款','1511':u'固定资产','1291':u'呆帐准备',
					'1292':u'抵债资产待变现利息','0848':u'手续费支出','0850':u'营业费用','0857':u'营业税金及附加','0858':u'其他营业支出','0872':u'营业外支出','0878':u'所得税','0877':u'手续费支出',
					'0878':u'以前年度损益调整','0900':u'重要空白凭证','0772':u'省辖往帐','0712':u'投资股','0713':u'股金（移植）','0720':u'资本公积','0918':u'代保管证券','0924':u'代保管其他有价值品',
					'0925':u'一卡通农户贷款表外欠息','0927':u'一卡通非农贷款表外欠息','0932':u'抵押有价物品','0901':u'重要空白凭证（手工）','0807':u'农户小额贷款利息收入','0814':u'金融机构往来收入','0820':u'手续费收入','0978':u'待报解预算收入（财税库银联网户）',
					'0979':u'待处理已置换资产损失','0980':u'贷款承诺','0981':u'开出保函款项','0982':u'保理款项','0933':u'消费贷款抵押有价物品','0934':u'消费贷款质押有价物品','0935':u'代保管有价单证','0937':u'质押有价值品',
					'0937':u'其它质押有价值品','0938':u'本年贷款应收利息','0939':u'抵押及质押有价物品－开出保函','0940':u'一卡通农户贷款抵质押有价物品','0941':u'一卡通非农贷款抵质押有价物品','0983':u'公积金委托贷款应收利息','0945':u'历年欠息(无对应贷款户)','0951':u'应收复利',
					'0702':u'账户管理费收入','0984':u'信用卡透支利息','0804':u'贴现利息收入','0805':u'其他利息收入','0773':u'省辖来帐','0704':u'上缴工会经费','0705':u'职工教育经费','0727':u'盈余公积',
					'0727':u'提取一般准备','0730':u'本年利润','0740':u'利润分配','0747':u'应收承兑汇票','0748':u'承兑汇票','0751':u'特约汇兑往帐','0774':u'上年省辖往帐','0775':u'上年省辖来帐',
					'0824':u'其他营业收入','0827':u'投资收益','0830':u'营业外收入','0837':u'买入返售金融资产利息收入','0838':u'利息支出','0847':u'金融机构往来支出','0757':u'特约汇兑来帐','0771':u'上年特约汇兑往帐',
					'0777':u'上年特约汇兑来帐','0777':u'省辖电子联行汇差','0778':u'省辖ATM/POS资金清算汇差','0779':u'省辖电子同城清算','0770':u'特约汇兑汇差','0771':u'上年特约汇兑汇差','0570':u'管理费收入','0503':u'借入支农再贷款',
					'0504':u'央行专项扶持资金','0507':u'同业存放款项','0508':u'信用社上存联社款项','0509':u'联社上存清算中心备付金存款','0454':u'零存整取定期储蓄存款','0455':u'整存零取定期储蓄存款','0457':u'大额定期储蓄存款','0528':u'卖出回购债券款',
					'0571':u'管理费支出','0572':u'养老金收入','0573':u'养老金支出','0574':u'失业保险金收入','0575':u'失业保险金支出','0547':u'应付利息','0547':u'保函保证金','0548':u'信用证开证保证金',
					'0579':u'应缴待扣利息税','0531':u'银行业拆入','0532':u'待解票据临时款','0533':u'金融性公司拆入','0534':u'应解汇款','0535':u'担保保证金','0537':u'临时存款','0537':u'待销帐户',
					'0538':u'汇出汇款','0539':u'消费贷款保证金','0570':u'委托公积金待转本金户','0571':u'委托公积金待转利息户','0572':u'应付利润','0574':u'预提费用','0575':u'待转资产价值','0577':u'接受捐赠非货币性资产价值',
					'0578':u'长期借款','0582':u'发行债券','0540':u'全国联行汇出汇款','0541':u'银行本票保证金','0588':u'代理业务负债','0589':u'代理业务负债','0593':u'代理业务负债','0595':u'代理业务负债',
					'0597':u'代理业务负债','0597':u'代理业务负债','0598':u'代理业务负债','0700':u'代理业务负债','0721':u'代理业务资产','0722':u'代理业务资产','0723':u'代理业务资产','0724':u'代理业务资产',
					'0725':u'代理业务资产','0770':u'代理业务负债','0771':u'代理业务负债','0231':u'抵押短期耐用消费品按揭贷款','0232':u'抵押短期其他按揭贷款','0233':u'抵押中长期楼宇按揭贷款','0234':u'抵押中长期汽车按揭贷款','0235':u'抵押中长期耐用消费品按揭贷款',
					'0287':u'待处理抵债资产--其他','0287':u'待处理抵债资产--土地使用权','0288':u'抵债资产待变现利息','0289':u'进口押汇','0290':u'买入外币票据','0291':u'待处理抵债资产--机器设备','0292':u'待处理抵债资产--交通工具','0257':u'呆滞中长期微小贷款',
					'0218':u'呆帐农户联保贷款','0219':u'呆帐助学贷款','0238':u'质押短期汽车按揭贷款','0239':u'质押短期耐用消费品按揭贷款','0240':u'质押短期其他按揭贷款','0241':u'质押中长期楼宇按揭贷款','0242':u'质押中长期汽车按揭贷款','0243':u'质押中长期耐用消费品按揭贷款',
					'0257':u'呆帐短期微小贷款','0258':u'呆帐中长期微小贷款','0307':u'历年贷款应收利息','0313':u'本年贷款应收利息（移植）','0314':u'其他应收利息','0317':u'应收再贴现款项','0317':u'应收转贴现款项','0320':u'贴现利息调整',
					'0321':u'其他应收款','0244':u'质押中长期其他按揭贷款','0245':u'逾期保证短期楼宇按揭贷款','0247':u'逾期保证短期汽车按揭贷款','0249':u'逾期保证中长期楼宇按揭贷款','0250':u'逾期保证中长期汽车按揭贷款','0251':u'短期微小贷款','0252':u'中长期微小贷款',
					'0093':u'专项贷款准备','0094':u'特种贷款准备','0097':u'代理业务资产','0100':u'农户小额贷款','0101':u'农户联保贷款','0123':u'其他农户贷款','0152':u'农村经济组织贷款','0157':u'农业产业化龙头企业贷款',
					'0157':u'农村小企业贷款','2007':u'待结算财政款项','0159':u'逾期保证短期农业经济组织贷款','0172':u'逾期信用中长期农业经济组织贷款','0173':u'逾期保证中长期农业经济组织贷款','0177':u'逾期信用短期农村工商业贷款','0177':u'逾期保证短期农村工商业贷款','0170':u'逾期信用中长期农村工商业贷款',
					'0171':u'逾期保证中长期农村工商业贷款','0214':u'呆帐短期私人贷款','0215':u'呆帐中长期其他单位贷款','0217':u'呆帐中长期私人贷款','0217':u'呆帐农户小额信用贷款','0200':u'呆滞短期其他单位贷款','0201':u'呆滞短期私人贷款','0202':u'呆滞中长期其他单位贷款',
					'0144':u'质押中长期农村工商业贷款','0145':u'质押短期其他单位贷款','0220':u'银行承兑汇票垫款','0221':u'短期楼宇保证按揭贷款','0222':u'保证短期汽车按揭贷款','0223':u'短期耐用消费品保证按揭贷款','0224':u'短期其他保证按揭贷款','0225':u'中长期楼宇保证按揭贷款',
					'0227':u'保证中长期汽车按揭贷款','0277':u'转贴现款项','0278':u'银行承兑汇票贴现','0279':u'商业承兑汇票贴现','0280':u'待处理抵债资产--房屋','0281':u'再贴现款项','0282':u'单位信用卡透支','0283':u'个人信用卡透支',
					'0284':u'待处理抵债资产--电子设备','0285':u'呆帐准备','0227':u'保证中长期耐用消费品按揭贷款','0228':u'保证中长期其他按揭贷款','0229':u'抵押短期楼宇按揭贷款','0230':u'抵押短期汽车按揭贷款','134':u'股东置换资产','0977':u'股东置换资产',
					'0194':u'呆滞短期农户贷款','0139':u'质押短期农户贷款','0140':u'质押中长期农户贷款','0141':u'质押短期农业经济组织贷款','0142':u'质押中长期农业经济组织贷款','0143':u'质押短期农村工商业贷款','0127':u'农户联保贷款','0127':u'助学贷款',
					'0195':u'呆滞中长期农户贷款','0197':u'呆滞短期农业经济组织贷款','0197':u'呆滞中长期农业经济组织贷款','0198':u'呆滞短期农村工商业贷款','0199':u'呆滞中长期农村工商业贷款','0174':u'逾期信用短期其他单位贷款','0175':u'逾期保证短期其他单位贷款','0203':u'呆滞中长期私人贷款',
					'0204':u'呆滞农户小额信用贷款','0128':u'抵押短期农户贷款','0147':u'质押中长期其他单位贷款','0147':u'质押短期私人贷款','0148':u'质押中长期私人贷款','0149':u'质押其它按揭贷款','0150':u'逾期信用短期农户贷款','0151':u'逾期保证短期农户贷款',
					'0154':u'逾期信用中长期农户贷款','0155':u'逾期保证中长期农户贷款','0205':u'呆滞农户联保贷款','0207':u'呆滞助学贷款','0207':u'呆帐短期农户贷款','0208':u'呆帐中长期农户贷款','0209':u'呆帐短期农业经济组织贷款','0210':u'呆帐中长期农业经济组织贷款',
					'0211':u'呆帐短期农村工商业贷款','0212':u'呆帐中长期农村工商业贷款','0213':u'呆帐短期其他单位贷款','0158':u'逾期信用短期农业经济组织贷款','0520':u'委托投资资金','0521':u'委托理财资金','0893':u'贷款减值损失','0905':u'保兑信用证',
					'0907':u'提货担保','0910':u'开出保函款项','0950':u'表外应收利息','0973':u'地方政府置换资产','1132':u'应收利息','130':u'表外应收利息','1302':u'农村经济组织贷款','1303':u'农村企业贷款',
					'1307':u'贸易融资-买入信贷资产','7701':u'资产减值损失','0085':u'贸易融资-买入信贷资产','0092':u'信用证垫款','0772':u'代理业务负债','0773':u'代理业务负债','0777':u'代理业务负债','0778':u'代理业务负债',
					'2431':u'应解汇款','2441':u'汇出汇款','2451':u'银行本票','2511':u'保证金','25111':u'银行承兑汇票保证金','2711':u'应付利息','2721':u'其他应付款','2811':u'外汇买卖',
					'2832':u'全国联行汇出汇款','2911':u'住房周转金','3011':u'实收资本（股本）','3012':u'股本金','3021':u'资本公积','3031':u'盈余公积','3041':u'一般准备','2722':u'委托及代理负债业务',
					'2731':u'应付工资','2741':u'应付福利费','2742':u'管理部门统筹资金','2751':u'应交税金','2753':u'应缴代扣利息税','2771':u'应付利润','2771':u'预提费用','3111':u'本年利润',
					'3121':u'利润分配','4401':u'待清算款项','4402':u'上年待清算款项','4701':u'特约汇兑往帐','4702':u'特约汇兑来帐','2711':u'长期借款','2775':u'待转资产价值','2417':u'卖出回购信贷资产款',
					'2421':u'金融性公司拆入','5151':u'营业外收入','5211':u'利息支出','5221':u'金融机构往来支出','109':u'低值易耗品','110':u'已置换不良贷款','111':u'待转国库存款利息','1112':u'准备金存款',
					'1113':u'存放中央银行特种存款','1114':u'缴存中央银行财政性存款','1115':u'专项央行票据','1117':u'央行专项扶持资金','112':u'应收外汇托收款项','1121':u'存放农业银行款项','1123':u'存放其他同业款项','1124':u'存放联社款项',
					'11241':u'上存扶持资金','1125':u'存放境外同业款项','107':u'抵押及质押有价物品','107':u'逾期贷款应收利息','113':u'代收外汇托收款项','114':u'国外开来信用凭证信','115':u'开出信用证','117':u'待处理已置换资产损失',
					'117':u'贷款承诺','118':u'开出保函款项','119':u'保理款项','120':u'公积金委托贷款应收利息','1211':u'调出调剂资金','1212':u'拆放银行业','1221':u'拆放金融性公司','1231':u'短期农户贷款',
					'1232':u'短期农业经济组织贷款','1233':u'短期农村工商业贷款','1234':u'短期其他贷款','1235':u'进出口押汇','1127':u'拨付营运资金','1127':u'存出保证金','12411':u'农户住房消费贷款','12412':u'农户汽车消费贷款',
					'0942':u'承兑汇票抵质押有价物品','0943':u'承兑汇票代保管有价物品','0907':u'有价单证','0908':u'未发行有价证券','0914':u'已兑付有价证券','0952':u'已核销贷款利息（移植）','0953':u'2001年以前已核销贷款利息','0954':u'已核销呆帐贷款',
					'0973':u'已冲销表内应收利息','0974':u'国外开来信用凭证信','0977':u'开出信用证','0955':u'已核销贷款利息','0957':u'电子设备','0957':u'机电设备','0958':u'保险柜、铁皮柜','0959':u'办公家具',
					'0970':u'通讯器材','0971':u'其他','0972':u'已置换不良贷款','0974':u'已核销资产','0975':u'待转国库存款利息','0978':u'应收外汇托收款项','0098':u'委托投资','0099':u'代客理财',
					'0253':u'逾期短期微小贷款','0254':u'逾期中长期微小贷款','0322':u'公积金委托贷款户','0323':u'一卡通非农贷款表内欠息','0324':u'委托及代理资产业务','0325':u'公积金贷款','0327':u'短期国债投资','0328':u'短期金融债券',
					'0329':u'长期投资面值','0335':u'入股联社资金','0340':u'营业用房','0255':u'呆滞短期微小贷款','0237':u'抵押中长期其他按揭贷款','0237':u'质押短期楼宇按揭贷款','0344':u'职工宿舍','0345':u'长期投资应收利息',
					'0347':u'长期投资溢折价','0348':u'其他房屋及建筑物','0349':u'汽车','0350':u'摩托车','0300':u'本年贷款应收利息','0302':u'一卡通农户贷款表内欠息','0304':u'暂收款项','0387':u'待处理流动资产损溢',
					'0400':u'活期存款(支票户)','0401':u'活期存款(外汇钞户)','0402':u'活期存款(存折户)','0407':u'一天单位通知存款','0351':u'船舶','0352':u'其他交通工具','0353':u'计算机网络','0354':u'自动取款机',
					'0355':u'其他电子设备','0357':u'传真机','0357':u'复印机','0358':u'监控设备','0407':u'七天单位通知存款','0408':u'单位协定存款','4712':u'上年特约汇兑来帐','0071':u'拆放银行业',
					'0072':u'存放其他银行','0073':u'存放工行','0071':u'拆放金融性公司','0080':u'存放中央银行款项（异地一般存款）','0023':u'存放股份制银行一般存款','0030':u'存放联社款项','0038':u'买入返售票据','0045':u'存放联社一般款项',
					'0047':u'信用社存放联社准备金','0047':u'一卡通农户贷款','0049':u'存放境外同业款项','0051':u'调出调剂资金','0052':u'一卡通非农贷款','0081':u'出口押汇','0083':u'其他应收款项','0084':u'国家助学贷款',
					'0087':u'逾期国家助学贷款','0087':u'呆滞国家助学贷款','0088':u'呆帐国家助学贷款','0090':u'贴现垫款','0091':u'保函业务垫款','0103':u'短期农户信用贷款','0104':u'短期农户保证贷款','0105':u'短期农业经济组织信用贷款',
					'0058':u'存放农行','0059':u'存放中行','0070':u'存放建行','0108':u'短期农村工商业保证贷款','0109':u'短期其他信用贷款','0110':u'短期其他保证贷款','0111':u'信用短期私人贷款','0112':u'保证短期私人贷款',
					'0113':u'中长期农户信用贷款','0114':u'中长期农户保证贷款','0115':u'信用中长期农业经济组织贷款','0117':u'保证中长期农业经济组织贷款','0410':u'其他活期存款','0411':u'财政性存款','0412':u'待结算财政款项','0413':u'粮食直补资金',
					'0414':u'地方财政库款','0415':u'财政预算专项存款','0417':u'财政预算外存款','0359':u'其他机器设备','0370':u'房屋及建筑累计折旧','0341':u'库房','0342':u'办公用房','0343':u'培训基地用房',
					'0374':u'其他固定资产累计折旧','0375':u'固定资产清理','0377':u'信用卡透支应收利息','0377':u'在建工程','0417':u'县级财政预算外存款','0418':u'整存整取一年以下定期存款','0380':u'应收转贴现','0384':u'广告费支出',
					'0387':u'待处理固定资产损溢','0422':u'待报解预算收入（财税库银联网户）','0423':u'单位信用卡','0425':u'个人借记卡','0427':u'个人信用卡','0378':u'其他固定资产','0379':u'信用卡应收费用','0370':u'土地使用权',
					'0371':u'房屋使用权','0372':u'专利权','0373':u'商誉','0374':u'其他无形资产','0375':u'无形资产损失','0377':u'开办费','0427':u'活期储蓄存款','0428':u'个人储蓄结算户',
					'0429':u'活期储蓄存单存款','0430':u'一天个人通知存款','0170':u'农村其他贷款','0247':u'个人消费贷款','0248':u'经济组织贷款','0259':u'企业贷款','0270':u'个人经营贷款','0301':u'表内应收利息',
					'0501':u'其他应付款项核心专用（应交税费）','0505':u'其他应付款项核心专用（资产化费用）','0507':u'其他应付款项核心专用（处置款）','0524':u'核销置换资金过渡户','0553':u'收回已核销不良贷款本金','0775':u'已减值贷款利息收入','0777':u'贸易融资利息收入','0854':u'受托贷款手续费收入',
					'0117':u'信用中长期农村工商业贷款','0118':u'保证中长期农村工商业贷款','0119':u'信用中长期其他单位贷款','0053':u'买入返售票据-利息调整','0055':u'拨付营运资金','0057':u'存放省联社','0057':u'买入返售债券','0012':u'存放中央银行特种存款',
					'0013':u'缴存中央银行财政性存款','0015':u'专项央行票据','0129':u'抵押中长期农户贷款','0120':u'保证中长期其他单位贷款','0121':u'信用中长期私人贷款','0122':u'保证中长期私人贷款','0125':u'农户小额信用贷款','0107':u'短期农业经济组织保证贷款',
					'0107':u'短期农村工商业信用贷款','0178':u'逾期信用短期私人贷款','0179':u'逾期保证短期私人贷款','0182':u'逾期信用中长期其他单位贷款','0130':u'抵押短期农业经济组织贷款','0131':u'抵押中长期农业经济组织贷款','0132':u'抵押短期农村工商业贷款','0133':u'抵押中长期农村工商业贷款',
					'0134':u'抵押短期其他单位贷款','0135':u'抵押中长期其他单位贷款','0137':u'抵押短期私人贷款','0137':u'抵押中长期私人贷款','0138':u'楼宇按揭贷款','0183':u'逾期保证中长期其他单位贷款','0187':u'逾期信用中长期私人贷款','0187':u'逾期保证中长期私人贷款',
					'0188':u'逾期其他贷款','0191':u'逾期农户小额信用贷款','0192':u'逾期农户联保贷款','0193':u'逾期助学贷款','0579':u'代理业务负债','0580':u'代理业务负债','0581':u'代理业务负债','0583':u'代理业务负债',
					'0584':u'代理业务负债','0585':u'代理业务负债','5311':u'手续费支出','5321':u'营业费用','2721':u'发行债券','4715':u'特约汇兑汇差','4717':u'上年特约汇兑汇差','4721':u'省辖往帐',
					'4722':u'省辖来帐','4725':u'上年省辖往帐','4727':u'上年省辖来帐','4729':u'省辖汇兑汇差','5331':u'营业税金及附加','5341':u'其他营业支出','5371':u'营业外支出','5501':u'所得税',
					'5701':u'以前年度损益调整','7011':u'应收承兑汇票','7012':u'承兑汇票','0001':u'现金','4731':u'县辖往帐','4732':u'县辖来帐','4735':u'上年县辖往帐','4737':u'上年县辖来帐',
					'4739':u'县辖汇兑汇差','4741':u'社（行）内往来','5011':u'利息收入','5021':u'金融机构往来收入','0002':u'业务周转金','0003':u'在途外币资金','0011':u'存放中央银行准备金存款','5121':u'其他营业收入',
					'5141':u'投资收益','0017':u'央行专项扶持资金','0021':u'存放其他同业存款（一般存款）','0022':u'存放其他同业存款（约期存款）','5111':u'手续费收入','4711':u'上年特约汇兑往帐','0431':u'七天个人通知存款','0432':u'定活两便储蓄存款',
					'0435':u'县级地方财政存款','0444':u'活期约定存款账户','0377':u'固定资产大修','0378':u'低值易耗品摊销','0379':u'递延资产损失','0371':u'交通工具累计折旧','0372':u'电子设备累计折旧','0373':u'机具设备累计折旧',
					'0457':u'预算单位零余额款项','0458':u'存本取息定期储蓄存款','0459':u'承兑汇票定期保证金','0450':u'整存整取定期储蓄存款(一年以下)','0451':u'整存整取定期储蓄存款(一年以上)','0452':u'境内非银行同业存放款项','0453':u'财政零余额款项','0419':u'整存整取一年以上定期存款',
					'0420':u'县级待结算财政款项','0421':u'单位借记卡','0549':u'银行本票','0550':u'收回已置换不良贷款本金','0470':u'华侨人民币定期储蓄存款','0472':u'教育储蓄存款','0473':u'卖出回购央行票据款','0474':u'定期储蓄存款（移植）',
					'0477':u'卖出回购票据款','0478':u'卖出回购票据－利息调整','0500':u'借入银行款','0502':u'借入中央银行款','0551':u'收回已置换不良贷款利息','0552':u'考核工资','0554':u'委托及代理负债业务','0555':u'住房公积金',
					'0557':u'应付工资','0557':u'委托公积金待放款户','0558':u'应付福利费','0559':u'委托公积金存款户'
					}
DEPOSIT_ACCOUNT_CODEDICT={ 
					"PE_FLAG":{'1':u'对私','2':u'对公','3':u'金融',},
					"CCY":{'01':u'人民币','02':u'美元','03':u'欧元','05':u'英镑','07':u'瑞士法郎','07':u'加拿大元','13':u'港币','27':u'日元',},
					"ACCOUNT_STATUS":{'A':u'冲正','0':u'正常','1':u'销户','2':u'冻结','3':u'封闭冻结','4':u'删除','5':u'未使用','7':u'结清','7':u'打印',
					'8':u'碰库','9':u'不动户',},
					"ACCOUNT_CLASSIFY": {'L':u'贷款账户','I':u'内部账户','P':u'对私活期存款','U':u'对公活期存款','T':u'定期存款','C':u"卡信息","A":u"表外账A","B":u"表外账B",},
					"BUSI_TYPE" : busi_type,
					"CALC_RATE_TYPE":{'0':u'不计息','1':u'不分段计息','2':u'按日浮动计息','3':u'按月浮动计息','4':u'按旬浮动计息','5':u'按季浮动计息','7':u'按半年浮动计息',
					'7':u'按年浮动计息','8':u'利随本清','9':u'特殊计息',},
					"PRODUCT_CODE": busi_type,
					"OWNER_FLAG":{'0':'主卡','1':'副卡'},
} 
DEPOSIT_ACCOUNT_CODEDICT ={}

INTERNAL_ACCOUNT_CODEDICT={ 
					"CCY":{'01':u'人民币','02':u'美元','03':u'欧元','05':u'英镑','07':u'瑞士法郎','07':u'加拿大元','13':u'港币','27':u'日元',},
					"ACCOUNT_STATUS":{'A':u'冲正','0':u'正常','1':u'销户','2':u'冻结','3':u'封闭冻结','4':u'删除','5':u'未使用','7':u'结清','7':u'打印',
					'8':u'碰库','9':u'不动户',},
					"CALC_RATE_TYPE":{'0':u'不计息','1':u'不分段计息','2':u'按日浮动计息','3':u'按月浮动计息','4':u'按旬浮动计息','5':u'按季浮动计息','7':u'按半年浮动计息',
					'7':u'按年浮动计息','8':u'利随本清','9':u'特殊计息',},
					"ACCOUNT_CLASSIFY": {'L':u'贷款账户','I':u'内部账户','P':u'对私活期存款','U':u'对公活期存款','T':u'定期存款','C':u"卡信息","A":u"表外账A","B":u"表外账B",},
} 
INTERNAL_ACCOUNT_CODEDICT={}
OUTSHEET_ACCOUNT_CODEDICT={ 
					"CCY":{'01':u'人民币','02':u'美元','03':u'欧元','05':u'英镑','07':u'瑞士法郎','07':u'加拿大元','13':u'港币','27':u'日元',},
					"ACCOUNT_STATUS":{'A':u'冲正','0':u'正常','1':u'销户','2':u'冻结','3':u'封闭冻结','4':u'删除','5':u'未使用','7':u'结清','7':u'打印',
					'8':u'碰库','9':u'不动户',},
					"CALC_RATE_TYPE":{'0':u'不计息','1':u'不分段计息','2':u'按日浮动计息','3':u'按月浮动计息','4':u'按旬浮动计息','5':u'按季浮动计息','7':u'按半年浮动计息',
					'7':u'按年浮动计息','8':u'利随本清','9':u'特殊计息',},
					"ACCOUNT_CLASSIFY": {'L':u'贷款账户','I':u'内部账户','P':u'对私活期存款','U':u'对公活期存款','T':u'定期存款','C':u"卡信息","A":u"表外账A","B":u"表外账B",},
} 
OUTSHEET_ACCOUNT_CODEDICT={}

def get_new_subj(subj_code,cpdm='-1'):
	if str(subj_code)  == '2111' and str(cpdm) in ['0427','0429'] :
		return '2003'
	elif str(subj_code)  == '2111' and str(cpdm) in ['0430','0431','0432'] :
		return '2004'
	elif str(subj_code)  == '21111' :
		return '2003'
	elif str(subj_code)  == '2016' :
		return '2016'
	else :
		return  SUBJ_DICT.get(str(subj_code),subj_code)
	

SUBJ_DICT={'1269': '1308', '2711': '2501', '2653': '2221', '2651': '2221', '1266': '1301', '3041': '4102', '5501': '6801', '2323': '2018', '2321': '2017', '2611': '2231', '1541': '1604', '3121': '4104', '2155': '2004', '2151': '2004', '2015': '2007', '2014': '2007', '2017': '2005', '2016': '2007', '2011': '2001', '2013': '2007', '2012': '2006', '2911': '2701', '5141': '6111', '2314': '2016', '4641': '3041', '2312': '2015', '2313': '2015', '1392': '1311', '2413': '2019', '2412': '2020', '2415': '2111', '1258': '1304', '1411': '1531', '5011': '6011', '1321': '1132', '1324': '1306', '5151': '6301', '1123': '1011', '1124': '1012', '1125': '1011', '1126': '3051', '1127': '1031', '115': '105', '114': '114', '5601': '6901', '110': '132', '113': '113', '112': '112', '5311': '6421', '3021': '4002', '1256': '1302', '1257': '1303', '1521': '1602', '2661': '2232', '1011': '1001', '1391': '1221', '1013': '1001', '1234': '1304', '1235': '1307', '1236': '1305', '2441': '2012', '1231': '1301', '1232': '1302', '1233': '1303', '4621': '3011', '4622': '3012', '109': '140', '4625': '3014', '4626': '3015', '5321': '6601', '102': '121', '4629': '3016', '101': '120', '106': '125', '2832': '2012', '104': '123', '2051': '2002', '3011': '4001', '108': '131', '2675': '2901', '1531': '1606', '1248': '1301', '3031': '4101', '1221': '1013', '5331': '6403', '4632': '3022', '4631': '3021', '4636': '3025', '4635': '3024', '103': '122', '601': '103', '4639': '3026', '1421': '1531', '1631': '1901', '1422': '1511', '5121': '6051', '2111': '2003', '105': '124', '2622': '2312', '1211': '1014', '2811': '3301', '5021': '6012', '2421': '2019', '5361': '6711', '4602': '3002', '4601': '3001', '1623': '1801', '1621': '1801', '5341': '6602', '5221': '6412', '111': '110', '1511': '1601', '2511': '2014', '1212': '1013', '5111': '6021', '2731': '2701', '2431': '2011', '2631': '2211', '2621': '2241', '5211': '6411', '4611': '3004', '4612': '3005', '4615': '3006', '1611': '1701', '1113': '1002', '1112': '1002', '1115': '1003', '1114': '1002', '1116': '1004', '1292': '1441', '1290': '1441', '1291': '1703', '1295': '1111', '2721': '2502', '2641': '2211', '2642': '2711', '1276': '1301', '1284': '1304', '1286': '1301', '1283': '1303', '1282': '1302', '1289': '1306', '3111': '4103', '107': '130'}#新科目：老科目
